Rurihelesta/esp32_ili9341_ft6336u_lvgl_GUIGuider/main/spi_master_example_main.c
/* SPI Master example

   This example code is in the Public Domain (or CC0 licensed, at your option.)

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "driver/spi_master.h"
#include "driver/gpio.h"
#include "lvgl.h"
#include "ui/generated/gui_guider.h"
#include "esp_lvgl_port.h"
#include "esp_log.h"
#include "esp_err.h"
#include "driver/i2c.h"

/*
 This code displays some fancy graphics on the 320x240 LCD on an ESP-WROVER_KIT board.
 This example demonstrates the use of both spi_device_transmit as well as
 spi_device_queue_trans/spi_device_get_trans_result and pre-transmit callbacks.

 Some info about the ILI9341/ST7789V: It has an C/D line, which is connected to a GPIO here. It expects this
 line to be low for a command and high for data. We use a pre-transmit callback here to control that
 line: every transaction has as the user-definable argument the needed state of the D/C line and just
 before the transaction is sent, the callback will set this line to the correct state.
*/
#define EXAMPLE_LCD_H_RES              320
#define EXAMPLE_LCD_V_RES              240
#ifdef CONFIG_IDF_TARGET_ESP32
#define LCD_HOST    HSPI_HOST

#define PIN_NUM_MISO 25
#define PIN_NUM_MOSI 35
#define PIN_NUM_CLK  36
#define PIN_NUM_CS   34

#define PIN_NUM_DC   38
#define PIN_NUM_RST  33
#define PIN_NUM_BCKL 39
#elif defined CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
#define LCD_HOST    SPI2_HOST

#define PIN_NUM_MISO 2
#define PIN_NUM_MOSI 5
#define PIN_NUM_CLK  4
#define PIN_NUM_CS   6

#define PIN_NUM_DC   GPIO_NUM_1
#define PIN_NUM_RST  GPIO_NUM_33
#define PIN_NUM_BCKL GPIO_NUM_NC
#elif defined CONFIG_IDF_TARGET_ESP32C3
#define LCD_HOST    SPI2_HOST

#define PIN_NUM_MISO 2
#define PIN_NUM_MOSI 7
#define PIN_NUM_CLK  6
#define PIN_NUM_CS   10

#define PIN_NUM_DC   9
#define PIN_NUM_RST  4
#define PIN_NUM_BCKL 5
#endif
#define EXAMPLE_TOUCH_I2C_NUM       I2C_NUM_1
#define EXAMPLE_TOUCH_I2C_SCL       GPIO_NUM_42
#define EXAMPLE_TOUCH_I2C_SDA       GPIO_NUM_41
#define EXAMPLE_TOUCH_GPIO_INT      GPIO_NUM_17
#define ESP_LCD_TOUCH_IO_I2C_TT21100_ADDRESS 0x38
#define EXAMPLE_TOUCH_I2C_CLK_HZ    100000
#define TOUCH_RST GPIO_NUM_NC
#define FT6336U_I2C_ADDR 0x38
#define FT6336U_REG_TOUCH_STATUS 0x02
#define FT6336U_REG_TOUCH1_XH 0x03
#define LV_USE_DEBUG 1
#define ESP_LVGL_PORT_TOUCH_COMPONENT 1
#define LV_USE_INDEV 1
static const char *TAG = "EXAMPLE";
static lv_indev_t *indev;
uint16_t touch_x, touch_y;
lv_ui guider_ui;
//To speed up transfers, every SPI transfer sends a bunch of lines. This define specifies how many. More means more memory use,
//but less overhead for setting up / finishing transfers. Make sure 240 is dividable by this.
#define PARALLEL_LINES 16
#define CONFIG_LV_INVERT_COLORS 1
/*
 The LCD needs a bunch of command/argument values to be initialized. They are stored in this struct.
*/
typedef struct {
    uint8_t cmd;
    uint8_t data[16];
    uint8_t databytes; //No of data in data; bit 7 = delay after set; 0xFF = end of cmds.
} lcd_init_cmd_t;

typedef enum {
    LCD_TYPE_ILI = 1,
    LCD_TYPE_ST,
    LCD_TYPE_MAX,
} type_lcd_t;

//Place data into DRAM. Constant data gets placed into DROM by default, which is not accessible by DMA.
DRAM_ATTR static const lcd_init_cmd_t st_init_cmds[]={
    /* Memory Data Access Control, MX=MV=1, MY=ML=MH=0, RGB=0 */
    {0x36, {(1<<5)|(1<<6)}, 1},
    /* Interface Pixel Format, 16bits/pixel for RGB/MCU interface */
    {0x3A, {0x55}, 1},
    /* Porch Setting */
    {0xB2, {0x0c, 0x0c, 0x00, 0x33, 0x33}, 5},
    /* Gate Control, Vgh=13.65V, Vgl=-10.43V */
    {0xB7, {0x45}, 1},
    /* VCOM Setting, VCOM=1.175V */
    {0xBB, {0x2B}, 1},
    /* LCM Control, XOR: BGR, MX, MH */
    {0xC0, {0x2C}, 1},
    /* VDV and VRH Command Enable, enable=1 */
    {0xC2, {0x01, 0xff}, 2},
    /* VRH Set, Vap=4.4+... */
    {0xC3, {0x11}, 1},
    /* VDV Set, VDV=0 */
    {0xC4, {0x20}, 1},
    /* Frame Rate Control, 60Hz, inversion=0 */
    {0xC6, {0x0f}, 1},
    /* Power Control 1, AVDD=6.8V, AVCL=-4.8V, VDDS=2.3V */
    {0xD0, {0xA4, 0xA1}, 1},
    /* Positive Voltage Gamma Control */
    {0xE0, {0xD0, 0x00, 0x05, 0x0E, 0x15, 0x0D, 0x37, 0x43, 0x47, 0x09, 0x15, 0x12, 0x16, 0x19}, 14},
    /* Negative Voltage Gamma Control */
    {0xE1, {0xD0, 0x00, 0x05, 0x0D, 0x0C, 0x06, 0x2D, 0x44, 0x40, 0x0E, 0x1C, 0x18, 0x16, 0x19}, 14},
    /* Sleep Out */
    {0x11, {0}, 0x80},
    /* Display On */
    {0x29, {0}, 0x80},
    {0, {0}, 0xff}
};

DRAM_ATTR static const lcd_init_cmd_t ili_init_cmds[]={
    /* Power contorl B, power control = 0, DC_ENA = 1 */
    {0xCF, {0x00, 0x83, 0X30}, 3},
    /* Power on sequence control,
     * cp1 keeps 1 frame, 1st frame enable
     * vcl = 0, ddvdh=3, vgh=1, vgl=2
     * DDVDH_ENH=1
     */
    {0xED, {0x64, 0x03, 0X12, 0X81}, 4},
    /* Driver timing control A,
     * non-overlap=default +1
     * EQ=default - 1, CR=default
     * pre-charge=default - 1
     */
    {0xE8, {0x85, 0x01, 0x79}, 3},
    /* Power control A, Vcore=1.6V, DDVDH=5.6V */
    {0xCB, {0x39, 0x2C, 0x00, 0x34, 0x02}, 5},
    /* Pump ratio control, DDVDH=2xVCl */
    {0xF7, {0x20}, 1},
    /* Driver timing control, all=0 unit */
    {0xEA, {0x00, 0x00}, 2},
    /* Power control 1, GVDD=4.75V */
    {0xC0, {0x26}, 1},
    /* Power control 2, DDVDH=VCl*2, VGH=VCl*7, VGL=-VCl*3 */
    {0xC1, {0x11}, 1},
    /* VCOM control 1, VCOMH=4.025V, VCOML=-0.950V */
    {0xC5, {0x35, 0x3E}, 2},
    /* VCOM control 2, VCOMH=VMH-2, VCOML=VML-2 */
    {0xC7, {0xBE}, 1},
    /* Memory access contorl, MX=MY=0, MV=1, ML=0, BGR=1, MH=0 */
    {0x36, {0x28}, 1},
    /* Pixel format, 16bits/pixel for RGB/MCU interface */
    {0x3A, {0x55}, 1},
    /* Frame rate control, f=fosc, 70Hz fps */
    {0xB1, {0x00, 0x1B}, 2},
    /* Enable 3G, disabled */
    {0xF2, {0x08}, 1},
    /* Gamma set, curve 1 */
    {0x26, {0x01}, 1},
    /* Positive gamma correction */
    {0xE0, {0x1F, 0x1A, 0x18, 0x0A, 0x0F, 0x06, 0x45, 0X87, 0x32, 0x0A, 0x07, 0x02, 0x07, 0x05, 0x00}, 15},
    /* Negative gamma correction */
    {0XE1, {0x00, 0x25, 0x27, 0x05, 0x10, 0x09, 0x3A, 0x78, 0x4D, 0x05, 0x18, 0x0D, 0x38, 0x3A, 0x1F}, 15},
    /* Column address set, SC=0, EC=0xEF */
    {0x2A, {0x00, 0x00, 0x00, 0xEF}, 4},
    /* Page address set, SP=0, EP=0x013F */
    {0x2B, {0x00, 0x00, 0x01, 0x3f}, 4},
    /* Memory write */
    {0x2C, {0}, 0},
    /* Entry mode set, Low vol detect disabled, normal display */
    {0xB7, {0x07}, 1},
    /* Display function control */
    {0xB6, {0x0A, 0x82, 0x27, 0x00}, 4},
    /* Sleep out */
    {0x11, {0}, 0x80},
    /* Display on */
    {0x29, {0}, 0x80},
    {0, {0}, 0xff},
};

/* Send a command to the LCD. Uses spi_device_polling_transmit, which waits
 * until the transfer is complete.
 *
 * Since command transactions are usually small, they are handled in polling
 * mode for higher speed. The overhead of interrupt transactions is more than
 * just waiting for the transaction to complete.
 */
void lcd_cmd(spi_device_handle_t spi, const uint8_t cmd)
{
    esp_err_t ret;
    spi_transaction_t t;
    memset(&t, 0, sizeof(t));       //Zero out the transaction
    t.length=8;                     //Command is 8 bits
    t.tx_buffer=&cmd;               //The data is the cmd itself
    t.user=(void*)0;                //D/C needs to be set to 0
    ret=spi_device_polling_transmit(spi, &t);  //Transmit!
    assert(ret==ESP_OK);            //Should have had no issues.
}

/* Send data to the LCD. Uses spi_device_polling_transmit, which waits until the
 * transfer is complete.
 *
 * Since data transactions are usually small, they are handled in polling
 * mode for higher speed. The overhead of interrupt transactions is more than
 * just waiting for the transaction to complete.
 */
void lcd_data(spi_device_handle_t spi, const uint8_t *data, int len)
{
    esp_err_t ret;
    spi_transaction_t t;
    if (len==0) return;             //no need to send anything
    memset(&t, 0, sizeof(t));       //Zero out the transaction
    t.length=len*8;                 //Len is in bytes, transaction length is in bits.
    t.tx_buffer=data;               //Data
    t.user=(void*)1;                //D/C needs to be set to 1
    ret=spi_device_polling_transmit(spi, &t);  //Transmit!
    assert(ret==ESP_OK);            //Should have had no issues.
}

//This function is called (in irq context!) just before a transmission starts. It will
//set the D/C line to the value indicated in the user field.
void lcd_spi_pre_transfer_callback(spi_transaction_t *t)
{
    int dc=(int)t->user;
    gpio_set_level(PIN_NUM_DC, dc);
}

uint32_t lcd_get_id(spi_device_handle_t spi)
{
    //get_id cmd
    lcd_cmd(spi, 0x04);

    spi_transaction_t t;
    memset(&t, 0, sizeof(t));
    t.length=8*3;
    t.flags = SPI_TRANS_USE_RXDATA;
    t.user = (void*)1;

    esp_err_t ret = spi_device_polling_transmit(spi, &t);
    assert( ret == ESP_OK );

    return *(uint32_t*)t.rx_data;
}

//Initialize the display
void lcd_init(spi_device_handle_t spi)
{
    int cmd=0;
    const lcd_init_cmd_t* lcd_init_cmds;

    //Initialize non-SPI GPIOs
    gpio_config_t io_conf = {};
    io_conf.pin_bit_mask = ((1ULL<<PIN_NUM_DC) | (1ULL<<PIN_NUM_RST) | (1ULL<<PIN_NUM_BCKL));
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pull_up_en = true;
    gpio_config(&io_conf);

    //Reset the display
    gpio_set_level(PIN_NUM_RST, 0);
    vTaskDelay(100 / portTICK_RATE_MS);
    gpio_set_level(PIN_NUM_RST, 1);
    vTaskDelay(100 / portTICK_RATE_MS);

    //detect LCD type
    uint32_t lcd_id = lcd_get_id(spi);
    int lcd_detected_type = 0;
    int lcd_type;

    printf("LCD ID: %08X\n", lcd_id);
    if ( lcd_id == 0 ) {
        //zero, ili
        lcd_detected_type = LCD_TYPE_ILI;
        printf("ILI9341 detected.\n");
    } else {
        // none-zero, ST
        lcd_detected_type = LCD_TYPE_ST;
        printf("ST7789V detected.\n");
    }

#ifdef CONFIG_LCD_TYPE_AUTO
    lcd_type = lcd_detected_type;
#elif defined( CONFIG_LCD_TYPE_ST7789V )
    printf("kconfig: force CONFIG_LCD_TYPE_ST7789V.\n");
    lcd_type = LCD_TYPE_ST;
#elif defined( CONFIG_LCD_TYPE_ILI9341 )
    printf("kconfig: force CONFIG_LCD_TYPE_ILI9341.\n");
    lcd_type = LCD_TYPE_ILI;
#endif
    if ( lcd_type == LCD_TYPE_ST ) {
        printf("LCD ST7789V initialization.\n");
        lcd_init_cmds = st_init_cmds;
    } else {
        printf("LCD ILI9341 initialization.\n");
        lcd_init_cmds = ili_init_cmds;
    }

    //Send all the commands
    while (lcd_init_cmds[cmd].databytes!=0xff) {
        lcd_cmd(spi, lcd_init_cmds[cmd].cmd);
        lcd_data(spi, lcd_init_cmds[cmd].data, lcd_init_cmds[cmd].databytes&0x1F);
        if (lcd_init_cmds[cmd].databytes&0x80) {
            vTaskDelay(100 / portTICK_RATE_MS);
        }
        cmd++;
    }

    ///Enable backlight
    gpio_set_level(PIN_NUM_BCKL, 0);
}


/* To send a set of lines we have to send a command, 2 data bytes, another command, 2 more data bytes and another command
 * before sending the line data itself; a total of 6 transactions. (We can't put all of this in just one transaction
 * because the D/C line needs to be toggled in the middle.)
 * This routine queues these commands up as interrupt transactions so they get
 * sent faster (compared to calling spi_device_transmit several times), and at
 * the mean while the lines for next transactions can get calculated.
 */
static void send_lines(spi_device_handle_t spi, int ypos, uint16_t *linedata)
{
    esp_err_t ret;
    int x;
    //Transaction descriptors. Declared static so they're not allocated on the stack; we need this memory even when this
    //function is finished because the SPI driver needs access to it even while we're already calculating the next line.
    static spi_transaction_t trans[6];

    //In theory, it's better to initialize trans and data only once and hang on to the initialized
    //variables. We allocate them on the stack, so we need to re-init them each call.
    for (x=0; x<6; x++) {
        memset(&trans[x], 0, sizeof(spi_transaction_t));
        if ((x&1)==0) {
            //Even transfers are commands
            trans[x].length=8;
            trans[x].user=(void*)0;
        } else {
            //Odd transfers are data
            trans[x].length=8*4;
            trans[x].user=(void*)1;
        }
        trans[x].flags=SPI_TRANS_USE_TXDATA;
    }
    trans[0].tx_data[0]=0x2A;           //Column Address Set
    trans[1].tx_data[0]=0;              //Start Col High
    trans[1].tx_data[1]=0;              //Start Col Low
    trans[1].tx_data[2]=(320)>>8;       //End Col High
    trans[1].tx_data[3]=(320)&0xff;     //End Col Low
    trans[2].tx_data[0]=0x2B;           //Page address set
    trans[3].tx_data[0]=ypos>>8;        //Start page high
    trans[3].tx_data[1]=ypos&0xff;      //start page low
    trans[3].tx_data[2]=(ypos+PARALLEL_LINES)>>8;    //end page high
    trans[3].tx_data[3]=(ypos+PARALLEL_LINES)&0xff;  //end page low
    trans[4].tx_data[0]=0x2C;           //memory write
    trans[5].tx_buffer=linedata;        //finally send the line data
    trans[5].length=320*2*8*PARALLEL_LINES;          //Data length, in bits
    trans[5].flags=0; //undo SPI_TRANS_USE_TXDATA flag

    //Queue all transactions.
    for (x=0; x<6; x++) {
        ret=spi_device_queue_trans(spi, &trans[x], portMAX_DELAY);
        assert(ret==ESP_OK);
    }

    //When we are here, the SPI driver is busy (in the background) getting the transactions sent. That happens
    //mostly using DMA, so the CPU doesn't have much to do here. We're not going to wait for the transaction to
    //finish because we may as well spend the time calculating the next line. When that is done, we can call
    //send_line_finish, which will wait for the transfers to be done and check their status.
}


static void send_line_finish(spi_device_handle_t spi)
{
    spi_transaction_t *rtrans;
    esp_err_t ret;
    //Wait for all 6 transactions to be done and get back the results.
    for (int x=0; x<6; x++) {
        ret=spi_device_get_trans_result(spi, &rtrans, portMAX_DELAY);
        assert(ret==ESP_OK);
        //We could inspect rtrans now if we received any info back. The LCD is treated as write-only, though.
    }
}

spi_device_handle_t spi_device; // Make spi_device global
//Simple routine to generate some patterns and send them to the LCD. Don't expect anything too
//impressive. Because the SPI driver handles transactions in the background, we can calculate the next line
//while the previous one is being sent.

static void lvgl_flush_cb(lv_disp_drv_t * disp_drv, const lv_area_t * area, lv_color_t * color_p)
{
    int32_t width = lv_area_get_width(area);
    int32_t height = lv_area_get_height(area);

    for(int y = area->y1; y <= area->y2; y += PARALLEL_LINES) {
        int actual_height = PARALLEL_LINES;
        if(y + PARALLEL_LINES > area->y2 + 1) {
            actual_height = area->y2 - y + 1;
        }
        send_lines(spi_device, y, (uint16_t *)color_p); // Send pixel data
        send_line_finish(spi_device);
        color_p += width * actual_height;
    }
    lv_disp_flush_ready(disp_drv);
}
static void lvgl_rounder_cb(lv_disp_drv_t * disp_drv, lv_area_t * area)
{
    area->x1 = 0;
    area->x2 = EXAMPLE_LCD_H_RES - 1;
}
static void i2c_start()
{
    esp_err_t ret;
    i2c_config_t i2c_conf = {
        .mode = I2C_MODE_MASTER,
        .sda_io_num = EXAMPLE_TOUCH_I2C_SDA,
        .scl_io_num = EXAMPLE_TOUCH_I2C_SCL,
        .sda_pullup_en = GPIO_PULLUP_ENABLE,
        .scl_pullup_en = GPIO_PULLUP_ENABLE,
        .master.clk_speed = EXAMPLE_TOUCH_I2C_CLK_HZ,
    };
    i2c_param_config(EXAMPLE_TOUCH_I2C_NUM, &i2c_conf);
    ret=i2c_driver_install(EXAMPLE_TOUCH_I2C_NUM, I2C_MODE_MASTER, 1024, 1024, 0);
    if(ret!=ESP_OK){
        ESP_LOGE(TAG,"i2c install fail:%s", esp_err_to_name(ret));
        return ret;
    }   
}


esp_err_t init_touch() {
    esp_err_t ret;
    gpio_config_t io_conf3 = {};
    io_conf3.pin_bit_mask = (1ULL<<TOUCH_RST);
    io_conf3.mode = GPIO_MODE_OUTPUT;
    io_conf3.pull_up_en = true;
    gpio_config(&io_conf3);
    
    gpio_set_level(TOUCH_RST, 0);
    vTaskDelay(pdMS_TO_TICKS(10));
    gpio_set_level(TOUCH_RST, 1);
    vTaskDelay(pdMS_TO_TICKS(100));

    
    ESP_LOGI(TAG, "touch_i2c_start");

    
    // i2c_scanner(EXAMPLE_TOUCH_I2C_NUM);

    

    return ESP_OK;
}
esp_err_t read_touch_num(i2c_port_t i2c_num, uint8_t *touch_num) {
    uint8_t reg_addr = 0x02; // 寄存器位址
    esp_err_t ret = i2c_master_write_read_device(i2c_num, FT6336U_I2C_ADDR, &reg_addr, 1, touch_num, 1, 1000 / portTICK_PERIOD_MS);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to read touch num: %s", esp_err_to_name(ret));
        return ret;
    }
    return ESP_OK;
}

esp_err_t ft6336u_get_touch_data(i2c_port_t i2c_num, uint16_t *x, uint16_t *y) {
    uint8_t data[4];
    esp_err_t ret;
    uint8_t touch_num;
    ret = read_touch_num(i2c_num, &touch_num); // 使用新的函式讀取 touch_num
    if (ret != ESP_OK) {
        return ret;
    }
    // ret = i2c_master_read_from_device(i2c_num, FT6336U_I2C_ADDR, &touch_num, 1, 1000 / portTICK_PERIOD_MS);
    // if (ret != ESP_OK) {
    //     ESP_LOGE(TAG, "Failed to read touch status: %s", esp_err_to_name(ret));
    //     return ret;
    // }

    if ((touch_num & 0x0F) == 1) {
        uint8_t reg_addr = FT6336U_REG_TOUCH1_XH;
        ret = i2c_master_write_read_device(i2c_num, FT6336U_I2C_ADDR, &reg_addr, 1, data, 4, 1000 / portTICK_PERIOD_MS);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to read touch data: %s", esp_err_to_name(ret));
            return ret;
        }
        *x = ((uint16_t)(data[0] & 0x0F) << 8) | data[1];
        *y = ((uint16_t)(data[2] & 0x0F) << 8) | data[3];

        ESP_LOGI(TAG, "touch_num%d", (touch_num));
        

    } else {
        *x = UINT16_MAX;
        *y = UINT16_MAX;
    }

    return ESP_OK;
}

static void example_lvgl_touch_cb(lv_indev_drv_t *drv, lv_indev_data_t *data) {
    static uint16_t last_x = 0;
    static uint16_t last_y = 0;

    
    esp_err_t ret = ft6336u_get_touch_data(EXAMPLE_TOUCH_I2C_NUM, &touch_x, &touch_y);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Error reading touch data: %s", esp_err_to_name(ret));
        data->state = LV_INDEV_STATE_REL;
        return;
    }

    if (touch_x != UINT16_MAX && touch_y != UINT16_MAX) {
        int16_t lvgl_x = 0;
        int16_t lvgl_y = 0;
        switch (lv_disp_get_rotation(NULL)) {
            case LV_DISP_ROT_NONE:
                lvgl_x = touch_y;
                lvgl_y = EXAMPLE_LCD_V_RES - 1 - touch_x;
                break;
            case LV_DISP_ROT_90:
                lvgl_x = EXAMPLE_LCD_V_RES - 1 - touch_y;
                lvgl_y = touch_x;
                break;
            case LV_DISP_ROT_180:
                lvgl_x = 
                lvgl_y = EXAMPLE_LCD_V_RES - 1 - touch_y;
                break;
            case LV_DISP_ROT_270:
                lvgl_x = touch_y;
                lvgl_y = EXAMPLE_LCD_H_RES - 1 - touch_x;
                break;
        }
        //ESP_LOGI(TAG, "Raw: x=%d, y=%d, LVGL: x=%d, y=%d", touch_x, touch_y, lvgl_x, lvgl_y); // Log 訊息
        data->point.x = lvgl_x;
        data->point.y = lvgl_y;
        data->state = LV_INDEV_STATE_PRESSED;
        last_x = touch_x;
        last_y = touch_y;
        ESP_LOGI(TAG,"Touch event: x=%d, y=%d,state=%d", data->point.x, data->point.y,data->state);
        lv_refr_now(NULL);
    } else {
        data->point.x = last_x;
        data->point.y = last_y;
        data->state = LV_INDEV_STATE_RELEASED;
        
    }
    
}
lv_disp_drv_t disp_drv;
void app(void *pvParameters)
{   
    
    esp_err_t ret;
    spi_device_handle_t spi;
    spi_bus_config_t buscfg={
        .miso_io_num=PIN_NUM_MISO,
        .mosi_io_num=PIN_NUM_MOSI,
        .sclk_io_num=PIN_NUM_CLK,
        .quadwp_io_num=-1,
        .quadhd_io_num=-1,
        .max_transfer_sz=EXAMPLE_LCD_V_RES*320*2+8
    };
    
    spi_device_interface_config_t devcfg={
#ifdef CONFIG_LCD_OVERCLOCK
        .clock_speed_hz=50*1000*1000,           //Clock out at 40 MHz
#else
        .clock_speed_hz=10*1000*1000,           //Clock out at 10 MHz
#endif
        .mode=0,                                //SPI mode 0
        .spics_io_num=PIN_NUM_CS,               //CS pin
        .queue_size=7,                          //We want to be able to queue 7 transactions at a time
        .pre_cb=lcd_spi_pre_transfer_callback,  //Specify pre-transfer callback to handle D/C line
    };
    //Initialize the SPI bus
    ret=spi_bus_initialize(LCD_HOST, &buscfg, SPI_DMA_CH_AUTO);
    ESP_ERROR_CHECK(ret);
    //Attach the LCD to the SPI bus
    ret=spi_bus_add_device(LCD_HOST, &devcfg, &spi);
    ESP_ERROR_CHECK(ret);
    //Initialize the LCD
    lcd_init(spi);
    
    

    spi_device = spi; // Assign the spi handle to the global variable
    lcd_cmd(spi,0x21);
    // Initialize LVGL
    lv_init();

    // Initialize display driver
    static lv_disp_draw_buf_t disp_buf;
    static lv_color_t buf[EXAMPLE_LCD_H_RES * EXAMPLE_LCD_V_RES]; // Buffer for parallel lines
    //static lv_color_t buf2[EXAMPLE_LCD_H_RES * EXAMPLE_LCD_V_RES]; // Buffer for parallel lines
    //lv_color_t *buf2 = (lv_color_t*)heap_caps_malloc(EXAMPLE_LCD_H_RES * EXAMPLE_LCD_V_RES, MALLOC_CAP_SPIRAM);
    lv_disp_draw_buf_init(&disp_buf, buf, NULL, EXAMPLE_LCD_H_RES * EXAMPLE_LCD_V_RES);

    
    lv_disp_drv_init(&disp_drv);
    disp_drv.flush_cb = lvgl_flush_cb;
    disp_drv.rounder_cb = lvgl_rounder_cb; // Set the rounder callback
    disp_drv.draw_buf = &disp_buf;
    disp_drv.hor_res = EXAMPLE_LCD_H_RES;
    disp_drv.ver_res = EXAMPLE_LCD_V_RES;
    disp_drv.full_refresh = 1;
    lv_disp_drv_register(&disp_drv);

    // Initialize input device (if you have one)
    
    i2c_start();

    ESP_LOGI(TAG,"i2c_ok");
    


    ret = init_touch();
    if (init_touch() != ESP_OK) {
        ESP_LOGE(TAG, "Touch initialization failed!");
        return;
    }
    else{
        ESP_LOGI(TAG,"init_touch_complete");
    }

    // Initialize LVGL input device
    static lv_indev_drv_t indev_drv;
    lv_indev_drv_init(&indev_drv);
    indev_drv.type = LV_INDEV_TYPE_POINTER;
    indev_drv.read_cb = example_lvgl_touch_cb;
    indev = lv_indev_drv_register(&indev_drv);
    lv_indev_enable(&indev_drv,1);
    
    // Create UI (using gui_guider)
    

    // Create a simple label for testing
    setup_ui(&guider_ui);
    while (1) {
        
        
    }
}
void tick(void *pvParameters){
    vTaskDelay(100);
    while (1)
    {
        lv_timer_handler();
        //LV_LOG_TRACE("Touch event: x=%d, y=%d", data->point.x, data->point.y);
        //  if (touch_x != UINT16_MAX && touch_y != UINT16_MAX) {
        //     ESP_LOGI(TAG, "Raw: x=%d, y=%d" ,touch_x, touch_y);
        //  }
        vTaskDelay(pdMS_TO_TICKS(1));
    }
    
    
    
}
void app_main(void){
    BaseType_t xReturned;
    TaskHandle_t xHandle = NULL;
    xReturned = xTaskCreate(app, "app",65536, NULL, 8, &xHandle); 
     if (xReturned == pdPASS) {
        ESP_LOGI(TAG, "Task created successfully");
    } else {
        ESP_LOGE(TAG, "Failed to create task");
        return; // 處理任務建立失敗的情況
    }
    xTaskCreate(tick, "tick",8192, NULL, 8, NULL);
}

